#+PROPERTY: header-args :noweb yes :exports both
#+PROPERTY: header-args:clojure :tangle dynamic.cljc :comments both
#+PROPERTY: header-args:dot :exports result
#+EXCLUDE_TAGS: noexport
#+OPTIONS: toc:nil

** A trace is a stream of operations

   It’s a steam of full sentences I could enunciate/express on the phone for
   someone else to draw on a whiteboard:

   1. =create= a node named =>control=.
   2. =create= a node named =>cross=.
   3. =attach= =>cross= to =>control=.
   4. =create= a node named =>z=.
   5. =attach= =>z= to =>cross=
   6. =resume= computation for =>control= with =:p=.
   7. =resume= computation for =>cross= with =:p=.
   8. =create= a node named =>p=
   9. =attach= =>z= to =>p=
   10. =resume= computation for =>p= with =1=.
   11. =resume= computation for =>z= with =1=.


   Removing noise, we encode the same statements as:

   #+NAME: sentences
   | verb   | subject  | object   |
   |--------+----------+----------|
   | create | >control |          |
   | create | >cross   |          |
   | attach | >cross   | >control |
   | create | >z       |          |
   | attach | >z       | >cross   |
   | resume | >control | :p       |
   | resume | >cross   | :p       |
   | create | >p       |          |
   | attach | >z       | >p       |
   | resume | >p       | 1        |
   | resume | >z       | 1        |


   Which maps to this code:

   #+begin_src clojure :var sentences=sentences :results output :noweb strip-export
   <<org-utils>>
   (def trace (from-table sentences))
   (pprint trace)
   #+end_src

   #+RESULTS:
   #+begin_example
   ((create >control )
    (create >cross )
    (attach >cross >control)
    (create >z )
    (attach >z >cross)
    (resume >control :p)
    (resume >cross :p)
    (create >p )
    (attach >z >p)
    (resume >p 1)
    (resume >z 1))
   #+end_example


   We need input nodes (create) because apply nodes requires them. If apply
   nodes were only arity-1, we could skip input nodes (simplify).


** The flow is a registry

   Nodes are uniquely identified. For each node, an identity is either provided
   or generated (gensymed). We can manualy look up a node or register it in a
   flow by =id= (or =name=, the two terms being interchangeable).

   #+begin_src clojure
   (defn id [node] (when node (.-id node)))
   #+end_src

   #+RESULTS:
   : #'minitest/id

   The flow being dynamic, nodes can get registered or unregistered by the flow
   itself. The flow is in charge of it’s own bookkeeping.

   Node identities are local to a flow. The flow can therefore be considered as
   a namespace.

   #+begin_src clojure
   (def flow (new hyperfiddle.Flow))                           (ref:flow-instance)
   #+end_src

   #+RESULTS:
   : #'minitest/flow

   #+begin_src clojure :results output :exports silent
   (tests
    (.lookup flow '>a)      => nil
    (id (.create flow '>a)) => '>a
    (id (.lookup flow '>a)) => '>a
    )
   #+end_src


** We can execute a trace operation against a flow

   A trace operations describes /what/ to do on one ore more objects. Executing
   an operation against a flow describes in /which context/ or /where/ to do it.

   - what :: =create= node =>p=
   - where :: on flow [[(flow-instance)][=f=]]

   To localize (provide a context) to an operation, we delegate the execution to
   the flow:
   #+begin_src clojure
   (defn execute! [flow [verb subject object]]
     (case verb
       create (.create flow subject)
       resume (.resume flow subject object)
       attach (.attach flow subject object)))
   #+end_src

   #+RESULTS:
   : #'hyperfiddle.dynamic/execute!



* Misc                                                             :noexport:
  :PROPERTIES:
  :UNNUMBERED: notoc
  :header-args: :eval no-export
  :END:


   #+NAME: org-utils
   #+begin_src clojure :tangle no
     (defn from-table "Parses an org-mode table to clojure"
       [rows]
       (for [row rows]
         (for [cell row]
           (if (string? cell)
             (clojure.edn/read-string cell)
             cell))))
   #+end_src

   #+RESULTS: org-utils
   : #'hyperfiddle.dynamic/from-table


